package JavaStudy;

public class ObjectConcept {

	public static void main(String[] args) {
		/*
		- 프로그램에서 사용되는 건 객체로 정의되고, 객체는 속성과 기능을 가지며, 각 개체는 메시지를 통해 소통한다.
		- 객체 지향은 생산성 향상과 재사용성을 높일 수 있다는 장점을 가지고 있다.
		- 클래스로부터 객체를 생성하는 과정을 실체화(instantiation)라고 하며, 객체를 instance라고도 한다.

		- 상속(inheritance): 상위 클래스의 모든 속성과 기능을 받고, 자신 만의 속성과 기능을 추가하는 것 / 중복 해결, 재사용 높임, 복잡한 수정 해결, 자바는 다중 상속 허용 X
		- 캡슐화(encapsulation): 객체의 실제 처리 정보를 숨김 / 정보 은폐, 이식성 좋아짐.
		- 메시지(Message): 객체에 일을 시키는 행위 / 객체 이름, 함수 이름, 인자 들 포함.
		- 추상화(abstraction): 복잡한 문제들의 공통적인 부분을 추출하고 추상 클래스로 제공, 상속을 이용하여 하위 클래스에서 문제들 개별 구현
		- 다형성(polymorphism): 서로 다른 객체가 동일한 메시지에 대해 서로 다른 방법으로 응답.
		 */

	}

}
